Tekla Open API Reference for Tekla Structures 2025
GraphicPolyLine Properties
The GraphicPolyLine type exposes the following members.
Properties
Name | Description
Color
 The line color.
PolyLine
 The path of the line.
Type
 The appearance of the line. For instance solid, dashed or dotted.
Width
 The line width in pixels. NOTE: Currently the valid width values are 1, 2 and 4
Top
See Also
Reference
GraphicPolyLine Class
Tekla.Structures.Model.UI Namespace